get the train data
(19608, 150)
get the test data
(4032, 150)

Load Stage One model.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_word (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
input_pos1 (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
input_pos2 (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 200)     2731600     input_word[0][0]                 
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 15)      285         input_pos1[0][0]                 
                                                                 input_pos2[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 150, 230)     0           embedding_1[0][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_2[1][0]                
__________________________________________________________________________________________________
gru_1 (GRU)                     (None, 150, 128)     137856      concatenate_1[0][0]              
__________________________________________________________________________________________________
multi_head_attention_c_1 (Multi (None, 150, 128)     66048       gru_1[0][0]                      
                                                                 gru_1[0][0]                      
                                                                 gru_1[0][0]                      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 148, 64)      24640       multi_head_attention_c_1[0][0]   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 144, 64)      20544       conv1d_1[0][0]                   
__________________________________________________________________________________________________
capsule_1 (Capsule)             (None, 2, 32)        4096        conv1d_2[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 2)            0           capsule_1[0][0]                  
==================================================================================================
Total params: 2,985,069
Trainable params: 253,469
Non-trainable params: 2,731,600
__________________________________________________________________________________________________

[[2931  128]
 [ 146  827]]


Load Stage Two model.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_word (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
input_pos1 (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
input_pos2 (InputLayer)         (None, 150)          0                                            
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 150, 200)     2731600     input_word[0][0]                 
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 150, 15)      285         input_pos1[0][0]                 
                                                                 input_pos2[0][0]                 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 150, 230)     0           embedding_1[0][0]                
                                                                 embedding_2[0][0]                
                                                                 embedding_2[1][0]                
__________________________________________________________________________________________________
gru_2 (GRU)                     (None, 150, 128)     137856      concatenate_2[0][0]              
__________________________________________________________________________________________________
multi_head_attention_c_2 (Multi (None, 150, 128)     66048       gru_2[0][0]                      
                                                                 gru_2[0][0]                      
                                                                 gru_2[0][0]                      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 148, 64)      24640       multi_head_attention_c_2[0][0]   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 144, 64)      20544       conv1d_3[0][0]                   
__________________________________________________________________________________________________
capsule_2 (Capsule)             (None, 4, 32)        8192        conv1d_4[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 4)            0           capsule_2[0][0]                  
==================================================================================================
Total params: 2,989,165
Trainable params: 257,565
Non-trainable params: 2,731,600
__________________________________________________________________________________________________

confusion matrix：
[[  37    0   41    2   16]
 [   2  192    2    1   24]
 [   0    5  289    7   57]
 [   0    8    4  237   49]
 [   3   24   54   47 2931]]
Corresponding result
for label 0 	 p= 0.880952171201864 	r= 0.3854166265191014 	f= 0.5362275719718947
for label 1 	 p= 0.8384279109856807 	r= 0.8687782412317537 	f= 0.853328297016934
for label 2 	 p= 0.7410256220249841 	r= 0.8072625472831692 	f= 0.7727222612493125
for label 3 	 p= 0.8061224215604619 	r= 0.7953019867348328 	f= 0.800670648885312
for label 4 	 p= 0.9525511831246305 	r= 0.9581562570835035 	f= 0.9553404989109635
for four class  label 	 p= 0.7905759079520848 	r= 0.7759506600621721 	f= 0.7831900130901869

